Revit 2027 API
BuiltInFailures.SketchFailures.TrussSwappedReferences Property
 Truss top reference must be above the bottom reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrussSwappedReferences { get; }
Public Shared ReadOnly Property TrussSwappedReferences As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrussSwappedReferences {
	FailureDefinitionId^ get ();
}
static member TrussSwappedReferences : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace